"""
Создать функцию к примеру "user_func" (название выбираете свое):
1. "user_func" принимает произвольное количество аргументов.
2. Алгротим должен перемножить все аргументы подданые на вход "user_func" , так-же должна быть проверка на тип INT.
3. "user_func" должна вывести резуальтат перемножения в print, а так-же сделать вернуть (return) его.

"user_func" должна быть обернута в ДЕКОРАТОР "user_decor" (название выбираете свое):
1. "user_decor" введет логирование (stdout,stderr) отработки "user_func" и записывает все в файл "user_log" (название выбираете свое)
Для проверки сделайте сознательную ошибку в "user_decor"
2. "user_decor" введет подсчет времени выполнения "user_func" и выводит его в print
"""