'''
1. Реализовать алгоритм сортировки выбором. Я это не объяснял, но задача преследует следующие цели :
    1. Гугление. Самостоятельный поиск объяснения логики алгоритма, т.е  не готовую реализацию в виде кода !!!
    3. Переформатирования мозга. При встрече, мне нужно объяснить код алгоритма, то как ты его понимаешь.
    3. Циклы и условные конструкции. Решаем вопрос с пониманием циклов и условиях.
2. Алгоритм пузырьковой сортировки упаковать в функцию bubble_def, которая обернута в декоратор decor_def,
    который считает время выполнения bubble_def и выводит информацию в файл start_end.txt.
    bubble_def принимает на вход произвольный список СПИСКОВ В КОТОРЫХ ПРОИЗВОЛЬНОЕ КОЛ-ВО ЭЛЕМЕНТОВ ТИПА int.
    [[4,1...n],[6,4,3...n]...n]
    Возращает отсортированЫЕ спискИ.
    [[1,4...n],[3,4,6...n]...n]
3. Алгоритм пузырьковой сортировки тоже переделать под списки списков, для сравнения скорости двух алгоритмов (пузырьковой и выбором)
4. Паш, тебе +  SQL задание доделать.
'''

